# Deadlock
### 학습 키워드
- Deadlock
## 1. 핵심 개념
### 데드락(Deadlock, 교착 상태)
두 개 이상의 스레드가 서로 상대방이 점유한 자원을 기다리며 무한 대기에 빠지는 교착 상태를 말한다.
### 식사하는 철학자 문제
데드락을 설명하는 대표적인 문제 상황.
- 가정
	원탁에서 다섯 명의 철학자들이 식사를 한다. 철학자들 사이에는 포크가 하나씩 놓여있다. 음식을 먹기 위해서는 양쪽의 포크를 들어야 한다.
- 진행
	- 왼쪽 포크가 사용 가능하면 집어든다.
	- 오른쪽 포크가 사용 가능하면 집어든다.
	- 왼쪽과 오른쪽 포크 모두 집어들면 저애진 시간동안 식사를 한다.
	- 식사가 끝나면 오른쪽 포크를 내려놓는다.
	- 오른쪽 포크를 내려놓은 뒤 왼쪽 포크를 내려놓는다.
	- 처음부터 반복한다.
- 문제 발생
	모든 철학자가 동시에 한쪽 포크를 집어든다면? 반대쪽 포크를 누군가 사용중이기 때문에 두 포크를 집어 식사를 하고, 다시 내려놓는 과정이 진행될 수 없다.
### 발생 조건
- 상호 배제
	자원을 한 번에 하나의 프로세스만 이용 가능하다.
- 점유와 대기
	자원을 할당받은 상태에서 다른 자원을 대기한다.
- 비선점
	다른 프로세스가 점유한 자원을 뺏어오지 못한다.
- 원형 대기
	요청 및 할당받은 자원이 원의 형태를 이룬다.
### 해결 방법
예방, 회피, 검출 및 회복으로 분류할 수 있다.
#### 예방
데드락 발생 조건 4가지 중 하나가 만족되지 않으면 데드락이 발생하지 않는 것을 이용한다.
- 상호 배제
	상호 배제를 없앤다는 것은 자원이 공유 가능한 상태가 된다는 것이다. 현실적으로 어렵다.
- 점유와 대기
	자원을 점유한 채로 다른 자원을 대기하는 일을 없앤다. 즉 특정 자원을 몰아서 받거나 아예 받지 않는다.
	이러한 방식은 자원을 오래 기다려야 하는 프로세스와 자원을 사용하지 않으면서 오랫동안 할당되는 자원을 다수 양산하기 때문에 자원의 활용률이 낮아진다. 또한 자원 소모가 많은 프로세스는 그렇지 않은 프로세스에 비해 우선순위가 상당히 밀린다.
- 비선점
	선점이 가능한 종류의 자원에 대해서는 효과적일 수 있음. 하지만 비선점이어야만 하는 자원들도 얼마든지 존재. 따라서 범용성이 떨어지는 방법.
- 원형 대기
	모든 자원에 순서를 부여해 순서대로 자원을 획득하게 하는 방법이다. 자원에 순서가 있기 때문에 원형 대기가 발생할 수 없다. 하지만 이 순서를 부여하는 것이 어렵고, 해당 순서가 프로세스가 필요로하는 순서가 아닐 경우 비효율이 발생한다. 
4가지 방법 모두 각자의 한계가 존재하는 방법이었다.
#### 회피
- 안전 상태: 교착 상태가 발생하지 않고 모든 프로세스가 정상적으로 자원을 할당받고 종료될 수 있는 상태
- 불안전 상태: 교착 상태가 발생할 수도 있는 상태
- 안전 순서열: 교착 상태 없이 안전하게 프로세스에 자원을 할당할 수 있는 순서. 안전 순서열이 있으면 안전 상태.
시스템 상태가 안전 상태에서 안전 상태로 이동하는 경우에만 자원을 할당하는 방식이 회피이다.
#### 검출 후 회복
- 선점을 통한 회복: 교착 상태가 해결될 때까지 자원을 몰아줌.
- 강제 종료를 통한 회복: 연관 프로세스를 모두, 또는 없어질 때까지 하나씩 프로세스 종료
## 2. 탐구 내용 (실무 / iOS 연결)

## 3. 의문 / 논점

## 4. 참고 자료
